# Прописание vlan на оборудовании

В примере нам необходимо прописать влан 3000 между портами 10 - аксес и 11 - транк.

Обозначение в выводе **---//---** будет применятся для экономии (пропускаем часть вывода которая нам не интересна в рамках данного материала)

Первым делом проверим или влан свободен на оборудовании
```
s1>show vlan 3000
  VlanId  : 3000  VlanStatus: disabled
  VlanName:
  VlanMode: Static
  Tagged ports    :
  Untagged ports  :
  Forbidden ports :
```
Как видно с вывода он выключен и не привязан к портам. Данное состояние стандартное и для новых и для разобранных вланов. Можем также посмотреть весь список прописанных вланов
```
s1>show vlan
s1>show vlan
  VlanType: 802.1q vlan

  VlanId  : 1     VlanStatus: enabled
  VlanName:
  VlanMode: Static
  Tagged ports    :
  Untagged ports  :
  Forbidden ports :

  VlanId  : 1000   VlanStatus: enabled
  VlanName: Switch_OaM
  VlanMode: Static
  Tagged ports    : 17-20,26-28
  Untagged ports  :
  Forbidden ports :

-------------//--------------------
  Total Vlans: 22
```
Мы не можем выключить влан **vlan 1**, поэтому его отвязали от портов командой:
```
s1(cfg)#set vlan 1 delete port 1-28
```

Переходим в режим конфигурации
```
s1>enable
password:************
s1(cfg)#
```
Создаем влан с номером 3000 и именем test_vlan_3000
```
s1(cfg)#create vlan 3000 name test_vlan_3000
```
Активируем наш влан
```
(cfg)#set vlan 3000 enable
```
Просмотрим наши порты
```
s1(cfg)#show port 10,11
  PortId     : 10
  PortParams :
    PortEnable     : disabled      MediaType      : 100BaseT
    Duplex         : auto          Speed          : auto
------------------------------//-----------------------------------------
  PortStatus :
    PortClass      : 802.3         Link           : down
    Duplex         : half          Speed          : 10Mbps
    DownTime       : 0 years  39 days 23 hours 19 minutes 21 seconds
    RecentUpTime   : 0 years   0 days  0 hours  0 minutes  0 seconds

  PortId     : 11
  PortParams :
    PortEnable     : disabled      MediaType      : 100BaseT
    Duplex         : auto          Speed          : auto
------------------------------//-----------------------------------------
  PortStatus :
    PortClass      : 802.3         Link           : down
    Duplex         : half          Speed          : 10Mbps
    DownTime       : 0 years  39 days 23 hours 19 minutes 21 seconds
    RecentUpTime   : 0 years   0 days  0 hours  0 minutes  0 seconds
```
Как мы видим порты в статусе **PortEnable: disabled**. Данный статус означает административную блокировку, желательно чтобы все порты по умолчанию были заблокированы

## Настроим транковый порт

Добавляем нужный нам влан
```
s1(cfg)#set vlan 3000 add port 11 tag
```
Создаем дескрипшин на порту s2:0/0/24
```
s1(cfg)#set port 11 description s2:0/0/24
```
Увы при траблшутинге значительно удобнее смотреть интерфейсы используя brief и там не отображается дескрипшин порта. 
```
s1(cfg)#show port 10 brief
Port summary:
  PortId  MediaType  Mode  Speed    Link       Description
  ------  ---------  ----  -------  ---------  --------------------
  10      100BaseT   half  10Mbps   down
```
Для исправления данной ситуации создаем имя для данного порта. Обратите внимание что большинство спецсимволов запрещено
```
s1(cfg)#create port 11 name s2_p0_0_24
```
Выключаем stp, если вы его не используете
```
s1(cfg)#set stp port 11 disable
```
Включаем защиту от петель, указываем необходимость блокировки в случае обнаружения и добавляем наш влан 3000
```
s1(cfg)#set loopdetect port 11 enable
s1(cfg)#set loopdetect port 11 vlan 3000 enable
```
Разблокируем наш порт
```
s1(cfg)#set port 11 enable
```
Просмотрим что у нас получилось
```
s1(cfg)#show port 11
  PortId     : 11
  Description: s2:0/0/24
  PortParams :
    PortEnable     : enabled       MediaType      : 100BaseT
------------------------------//---------------------------------

s1(cfg)#show vlan 3000
  VlanId  : 3000  VlanStatus: enabled
  VlanName: test_vlan_3000
  VlanMode: Static
  Tagged ports    : 11
  Untagged ports  :
  Forbidden ports :
```
## Настроим аксесный порт

Присваеваем название порту
```
s1(cfg)#set port 10 description port_for_user
s1(cfg)#create port 10 name port_for_user
```
Включаем защиту от петель и выключаем stp
```
s1(cfg)#set loopdetect port 10 enable
s1(cfg)#set stp port 10 disable
```
Привязываем наш влан 3000 и указываем что он не тегированый
```
s1(cfg)#set vlan 3000 add port 10 untag
```
Прописываем номер нашего влана как pvid на порту
```
s1(cfg)#set port 10 pvid 3000
```
Не забываем разблокировать порт
```
s1(cfg)#set port 10 enable
```
Посмотрим что у нас получилось
```
s1(cfg)#show port 10
  PortId     : 10
  PortName   : port_for_user
  Description: port_for_user
  PortParams :
    PortEnable     : enabled       MediaType      : 100BaseT
    Duplex         : auto          Speed          : auto
    DefaultVlanId  : 3000          FlowControl    : disabled
--------------------------//----------------------------------------------
```
Теперь проверим наш влан
```
s1(cfg)#show vlan 3000
  VlanId  : 3000  VlanStatus: enabled
  VlanName: test_vlan_3000
  VlanMode: Static
  Tagged ports    : 11
  Untagged ports  : 10
  Forbidden ports :
```
Как мы видим влан 3000 настроен транком порту 11 транком, а также аксесом на порту 10

## Ограничение скорости на портах
Хотелось бы оговорится что данный функционал работает очень своеобразно и если есть возможность зажмите скорость где-то в другом месте, а не на этом оборудовании.
Мы можем ограничить скорость на порту при необходимости. В примере включено ограничение на 10Мбит. При расчетах нужную вам скорость до 10Мбит умножаете на 1096, а после на 1024 (компенсируем технический трафик).
Праметр **burst-size** рассчитан экспериментально, необходимо умножить **data-rate** на **0,31**

Команда set qos traffic-shaping отвечает за Download, а команда set qos traffic-limit за Upload со стороны клиента.

В связи с особености настройки:

### На физических портах - 100Мб/с
```
s1(cfg)#set qos traffic-limit fe-port 10 data-rate 2048    
s1(cfg)#set qos traffic-shaping fe-port 10 data-rate 2048 burst-size 339
```
### На физических портах - 1Гб/с
```
s1(cfg)#set qos traffic-limit ge-port 27 data-rate 20480
s1(cfg)#set qos traffic-shaping ge-port 27 data-rate 20480
```
## Настройка порта в режиме qinq

Для примера настроим порт 10, дополнительно к настройки аксесного порта необходимо добавить:
```
s1(cfg)#set vlan qinq customer port 10 enable
```
На транковом порту тоже включаем qinq и разрешаем jumbo (большие размеры фремов)
```
s1(cfg)#set vlan qinq uplink port 11 enable
s1(cfg)#set jumbo port 11 enable
```
Если у вас свитч стоит по средине, то необходимо включить jumbo на обоих транковых портах

Посмотрим что у нас получилось
```
s1(cfg)#show vlan qinq
  Customer port  : 10
  Uplink port    : 11
s1(cfg)#show jumbo
  Max-frame size is 10240 bytes(include 4 bytes CRC)
  PortId  Jumbo
  ------  -------
-----------//--------------------
  10      disable
  11      enable
  12      disable
  13      disable
-----------//--------------------
```
## Разбираем влан

Очищаем конфиг с аксесного порта
```
s1(cfg)#set port 10 pvid 4094
s1(cfg)#set vlan 3000 delete port 10
s1(cfg)#clear port 10 name
s1(cfg)#clear port 10 description
s1(cfg)#set port 10 disable
```
Очищаем транковый порт
```
s1(cfg)#set vlan 3000 delete port 11
s1(cfg)#clear port 11 name
s1(cfg)#clear port 11 description
s1(cfg)#set port 11 disable
```
Удаляем имя влана
```
s1(cfg)#clear vlan 3000 name
```
И выключаем его
```
s1(cfg)#set vlan 3000 disable
```
